import { v4 } from 'uuid';

export const textInfoAppartId = [
  {
    id: v4(),
    title: 'Розрахунковий час — 12:00 година дня.',
    titleEN: 'Розрахунковий час — 12:00 година дня.',
    text: 'Надаються документи по 2 та 3 групі з наявністю касового апарату (робота з підприємствами, ПДВ).',
    textEN:
      'Надаються документи по 2 та 3 групі з наявністю касового апарату (робота з підприємствами, ПДВ).',
  },
  {
    id: v4(),
    title: 'Ціна:',
    titleEN: 'Ціна:',
    text: 'Вартість проживання залежить від кількості днів та гостей. Ціна може змінюватися залежно від дати бронювання, кількості гостей та загального періоду бронювання.',
    textEN:
      'Вартість проживання залежить від кількості днів та гостей. Ціна може змінюватися залежно від дати бронювання, кількості гостей та загального періоду бронювання.',
  },
  {
    id: v4(),
    title: 'Правила:',
    titleEN: 'Правила:',
    rulesList: [
      {
        id: v4(),
        rules:
          '-Заборона організації заходів: Абсолютно заборонено проведення заходів, компаній та торжеств у даній квартирі.',
        rulesEN:
          '-Заборона організації заходів: Абсолютно заборонено проведення заходів, компаній та торжеств у даній квартирі.',
      },
      {
        id: v4(),
        rules:
          '-Обмеження кількості гостей: Згідно з угодою, максимальна кількість проживаючих суворо обмежена.',
        rulesEN:
          '-Обмеження кількості гостей: Згідно з угодою, максимальна кількість проживаючих суворо обмежена.',
      },
      {
        id: v4(),
        rules:
          "-Санкції за порушення правил: Всі порушення вищезазначених правил будуть розглядатися як серйозні і призведуть до виселення гостей з зобов'язанням оплатити всі надані послуги.",
        rulesEN:
          "-Санкції за порушення правил: Всі порушення вищезазначених правил будуть розглядатися як серйозні і призведуть до виселення гостей з зобов'язанням оплатити всі надані послуги.",
      },
    ],
  },
  {
    id: v4(),
    text: "Прохання уважно ознайомитися з вищезазначеними правилами перед заселенням. Дотримання цих правил обов'язкове для створення безпечного і комфортного середовища для всіх гостей.",
    textEN:
      "Прохання уважно ознайомитися з вищезазначеними правилами перед заселенням. Дотримання цих правил обов'язкове для створення безпечного і комфортного середовища для всіх гостей.",
  },
  {
    id: v4(),
    text: 'Дякуємо за Ваше розуміння. Ми готові зробити ваше перебування зручним і приємним!',
    textEN:
      'Дякуємо за Ваше розуміння. Ми готові зробити ваше перебування зручним і приємним!',
  },
];
